# Python: pandas

<table>
    <tr>
        <td><img width=200 src="https://upload.wikimedia.org/wikipedia/commons/thumb/5/51/IBM_logo.svg/800px-IBM_logo.svg.png"></td>
        <td><img width=200 src="https://skillup.online/_next/static/media/Logo.c31d02e9.svg"></td>
    </tr>
<table>

<div style="text-align: right"><a>par </a><a href="https://www.linkedin.com/in/sheriff-data/">Manuel López Sheriff</a></div>

<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#Intro" data-toc-modified-id="Intro-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>Intro</a></span></li><li><span><a href="#Installation" data-toc-modified-id="Installation-2"><span class="toc-item-num">2&nbsp;&nbsp;</span>Installation</a></span></li><li><span><a href="#Structures-de-données-dans-pandas" data-toc-modified-id="Structures-de-données-dans-pandas-3"><span class="toc-item-num">3&nbsp;&nbsp;</span>Structures de données dans pandas</a></span><ul class="toc-item"><li><span><a href="#Series" data-toc-modified-id="Series-3.1"><span class="toc-item-num">3.1&nbsp;&nbsp;</span>Series</a></span></li><li><span><a href="#DataFrames" data-toc-modified-id="DataFrames-3.2"><span class="toc-item-num">3.2&nbsp;&nbsp;</span>DataFrames</a></span></li></ul></li><li><span><a href="#Charger-des-données-depuis-un-fichier" data-toc-modified-id="Charger-des-données-depuis-un-fichier-4"><span class="toc-item-num">4&nbsp;&nbsp;</span>Charger des données depuis un fichier</a></span><ul class="toc-item"><li><span><a href="#.csv" data-toc-modified-id=".csv-4.1"><span class="toc-item-num">4.1&nbsp;&nbsp;</span>.csv</a></span></li><li><span><a href="#.xlsx" data-toc-modified-id=".xlsx-4.2"><span class="toc-item-num">4.2&nbsp;&nbsp;</span>.xlsx</a></span></li></ul></li><li><span><a href="#Exploration-d'un-DataFrame" data-toc-modified-id="Exploration-d'un-DataFrame-5"><span class="toc-item-num">5&nbsp;&nbsp;</span>Exploration d'un DataFrame</a></span></li><li><span><a href="#Navigation-par-colonne" data-toc-modified-id="Navigation-par-colonne-6"><span class="toc-item-num">6&nbsp;&nbsp;</span>Navigation par colonne</a></span></li><li><span><a href="#Sélection-dans-le-DataFrame" data-toc-modified-id="Sélection-dans-le-DataFrame-7"><span class="toc-item-num">7&nbsp;&nbsp;</span>Sélection dans le DataFrame</a></span><ul class="toc-item"><li><span><a href="#par-nom-de-colonne" data-toc-modified-id="par-nom-de-colonne-7.1"><span class="toc-item-num">7.1&nbsp;&nbsp;</span>par nom de colonne</a></span></li><li><span><a href="#par-condition" data-toc-modified-id="par-condition-7.2"><span class="toc-item-num">7.2&nbsp;&nbsp;</span>par condition</a></span></li><li><span><a href="#par-indice-numérique" data-toc-modified-id="par-indice-numérique-7.3"><span class="toc-item-num">7.3&nbsp;&nbsp;</span>par indice numérique</a></span></li></ul></li><li><span><a href="#Création-de-colonnes" data-toc-modified-id="Création-de-colonnes-8"><span class="toc-item-num">8&nbsp;&nbsp;</span>Création de colonnes</a></span></li><li><span><a href="#Traitement-des-valeurs-nulles" data-toc-modified-id="Traitement-des-valeurs-nulles-9"><span class="toc-item-num">9&nbsp;&nbsp;</span>Traitement des valeurs nulles</a></span><ul class="toc-item"><li><span><a href="#remplissage-fixe" data-toc-modified-id="remplissage-fixe-9.1"><span class="toc-item-num">9.1&nbsp;&nbsp;</span>remplissage fixe</a></span></li><li><span><a href="#remplissage-avec-la-moyenne" data-toc-modified-id="remplissage-avec-la-moyenne-9.2"><span class="toc-item-num">9.2&nbsp;&nbsp;</span>remplissage avec la moyenne</a></span></li><li><span><a href="#supprimer-une-colonne" data-toc-modified-id="supprimer-une-colonne-9.3"><span class="toc-item-num">9.3&nbsp;&nbsp;</span>supprimer une colonne</a></span></li><li><span><a href="#supprimer-des-lignes" data-toc-modified-id="supprimer-des-lignes-9.4"><span class="toc-item-num">9.4&nbsp;&nbsp;</span>supprimer des lignes</a></span></li></ul></li><li><span><a href="#GroupBy" data-toc-modified-id="GroupBy-10"><span class="toc-item-num">10&nbsp;&nbsp;</span>GroupBy</a></span></li><li><span><a href="#Application-des-fonctions" data-toc-modified-id="Application-des-fonctions-11"><span class="toc-item-num">11&nbsp;&nbsp;</span>Application des fonctions</a></span></li><li><span><a href="#Exportation-des-données" data-toc-modified-id="Exportation-des-données-12"><span class="toc-item-num">12&nbsp;&nbsp;</span>Exportation des données</a></span></li><li><span><a href="#Recap:-métodos-más-utilizados-de-pandas" data-toc-modified-id="Recap:-métodos-más-utilizados-de-pandas-13"><span class="toc-item-num">13&nbsp;&nbsp;</span>Recap: métodos más utilizados de pandas</a></span></li><li><span><a href="#Récapitulatif-:-les-méthodes-les-plus-utilisées-de-pandas" data-toc-modified-id="Récapitulatif-:-les-méthodes-les-plus-utilisées-de-pandas-14"><span class="toc-item-num">14&nbsp;&nbsp;</span>Récapitulatif : les méthodes les plus utilisées de pandas</a></span></li><li><span><a href="#Matériel-supplémentaire-!" data-toc-modified-id="Matériel-supplémentaire-!-15"><span class="toc-item-num">15&nbsp;&nbsp;</span>Matériel supplémentaire !</a></span></li></ul></div>

<img width=600 src="https://www.adictosaltrabajo.com/wp-content/uploads/2020/12/1200px-Pandas_logo.svg_.png">

## Intro

pandas est la bibliothèque Python **la plus utilisée** pour l'analyse des données. Elle l'est :

 * rapide

 * puissant

 * flexible

 * facile à utiliser

 * open source ([voir le code source](https://github.com/pandas-dev/pandas))

[Documentation de pandas](https://pandas.pydata.org/docs/reference/index.html#api)

`pandas` nous aide dans nombre de nos activités de scientifique des données

## Installation

Rappelez-vous que tout texte préfixé par `!` simule une exécution en mode console.

In [2]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\manue\appdata\local\programs\python\python38\lib\site-packages (1.1.4)

[notice] A new release of pip available: 22.2.2 -> 22.3.1
[notice] To update, run: python.exe -m pip install --upgrade pip

Requirement already satisfied: python-dateutil>=2.7.3 in c:\users\manue\appdata\local\programs\python\python38\lib\site-packages (from pandas) (2.8.1)
Requirement already satisfied: pytz>=2017.2 in c:\users\manue\appdata\local\programs\python\python38\lib\site-packages (from pandas) (2020.4)
Requirement already satisfied: numpy>=1.15.4 in c:\users\manue\appdata\local\programs\python\python38\lib\site-packages (from pandas) (1.19.4)
Requirement already satisfied: six>=1.5 in c:\users\manue\appdata\local\programs\python\python38\lib\site-packages (from python-dateutil>=2.7.3->pandas) (1.15.0)

In [3]:
import pandas as pd

## Structures de données dans pandas

### Series

Un `pd.Series` est un objet tableau **unidimensionnel** où chaque élément a un nom (index, pas nécessairement numérique).

In [4]:
s = pd.Series([7, 18, 22, 4], index=["Juan", "Emilio", "Rosa", "Tania"])

In [6]:
s

Juan       7
Emilio    18
Rosa      22
Tania      4
dtype: int64

In [7]:
type(s)

pandas.core.series.Series

In [8]:
s.index

Index(['Juan', 'Emilio', 'Rosa', 'Tania'], dtype='object')

In [9]:
s.values

array([ 7, 18, 22,  4], dtype=int64)

In [10]:
s["Juan"]

7

On peut considérer un `pd.Series` comme un `dict` trié, car il associe chaque index à une valeur.



`pandas` est très intelligent, et si vous avez des données contenues dans un `dict` Python, vous pouvez facilement créer un `pd.Series`

In [11]:
pop = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [12]:
pop

{'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [13]:
type(pop)

dict

In [14]:
pop["Ohio"]

35000

In [16]:
populations = pd.Series(pop)

In [17]:
type(populations)

pandas.core.series.Series

In [18]:
populations

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [19]:
populations["Ohio"]

35000

In [20]:
populations * 1.05

Ohio      36750.0
Texas     74550.0
Oregon    16800.0
Utah       5250.0
dtype: float64

In [22]:
populations > 10000

Ohio       True
Texas      True
Oregon     True
Utah      False
dtype: bool

In [24]:
populations[populations > 10000]

Ohio      35000
Texas     71000
Oregon    16000
dtype: int64

### DataFrames

In [25]:
import numpy as np

In [26]:
# desde un diccionario
data = {
    'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
    'year': [2000, 2001, 2002, 2001, 2002, 2003],
    'pop': [1.5, 1.7, 3.6, 2.4, 2.9, np.nan]
}

In [27]:
type(data)

dict

In [28]:
df = pd.DataFrame(data)

In [29]:
df

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  NaN

In [30]:
datos = [
    {
        'nombre': 'Fer',
        'apellido': 'Castro',
        'email': 'fer.castro@gmail.com',
        'edad': 30,
    }, 
    {
        'nombre': 'Ana',
        'apellido': 'García',
        'email': 'ana.garcia@hotmail.com',
        'edad': 34,
    },
    {
        'nombre': 'Juan',
        'apellido': 'Lopez',
        'email': 'juan.lopez@gmail.com',
        'edad': 26,
    }
]

In [31]:
type(datos)

list

In [32]:
len(datos)

3

In [33]:
df2 = pd.DataFrame(datos)

In [34]:
df2

  nombre apellido                   email  edad
0    Fer   Castro    fer.castro@gmail.com    30
1    Ana   García  ana.garcia@hotmail.com    34
2   Juan    Lopez    juan.lopez@gmail.com    26

## Charger des données depuis un fichier

Pandas peut lire et écrire des données à partir d'une grande variété de formats.



[Documentation](https://pandas.pydata.org/pandas-docs/stable/user_guide/io.html)

### .csv

In [35]:
df = pd.read_csv("../datasets/titanic.csv")

In [36]:
df.shape

(1309, 11)

In [37]:
df.head()

,Name,Sex,Age,Pclass,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,"Karaic, Mr. Milan",male,30.0,3,0,0,349246,7.8958,NaN,S,0
1,"Dean, Mrs. Bertram",female,33.0,3,1,2,C.A. 2315,20.5750,NaN,S,1
2,"Rice, Mrs. William",female,39.0,3,0,5,382652,29.1250,NaN,Q,0
3,"Davidson, Mrs. Thornton",female,27.0,1,1,2,F.C. 12750,52.0000,B71,S,1
4,"Ridsdale, Miss. Lucy",female,50.0,2,0,0,W./C. 14258,10.5000,NaN,S,1

### .xlsx

In [38]:
cars = pd.read_excel("../datasets/cars.xlsx", engine='openpyxl')

In [40]:
cars.shape

(398, 9)

In [39]:
cars.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model year,origin,car name
0,18.0,8,307.0,130,3504,12.0,70.0,1,chevrolet chevelle malibu
1,15.0,8,350.0,165,3693,11.5,70.0,1,buick skylark 320
2,18.0,8,NaN,150,3436,11.0,70.0,1,plymouth satellite
3,16.0,8,304.0,150,3433,12.0,70.0,1,amc rebel sst
4,17.0,8,302.0,140,3449,10.5,70.0,1,ford torino

In [41]:
type(cars)

pandas.core.frame.DataFrame

## Exploration d'un DataFrame

In [44]:
cars.shape

(398, 9)

In [42]:
cars.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model year,origin,car name
0,18.0,8,307.0,130,3504,12.0,70.0,1,chevrolet chevelle malibu
1,15.0,8,350.0,165,3693,11.5,70.0,1,buick skylark 320
2,18.0,8,NaN,150,3436,11.0,70.0,1,plymouth satellite
3,16.0,8,304.0,150,3433,12.0,70.0,1,amc rebel sst
4,17.0,8,302.0,140,3449,10.5,70.0,1,ford torino

In [43]:
cars.tail()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model year,origin,car name
393,27.0,4,140.0,86,2790,15.6,82.0,1,ford mustang gl
394,44.0,4,97.0,52,2130,24.6,82.0,2,vw pickup
395,32.0,4,135.0,84,2295,11.6,82.0,1,dodge rampage
396,28.0,4,120.0,79,2625,18.6,82.0,1,ford ranger
397,31.0,4,119.0,82,2720,19.4,82.0,1,chevy s-10

In [46]:
cars.sample(5)

,mpg,cylinders,displacement,horsepower,weight,acceleration,model year,origin,car name
5,15.0,8,429.0,198,4341,10.0,70.0,1,ford galaxie 500
367,28.0,4,112.0,88,2605,19.6,82.0,1,chevrolet cavalier
290,15.5,8,351.0,142,4054,14.3,79.0,1,ford country squire (sw)
331,33.8,4,97.0,67,2145,18.0,80.0,3,subaru dl
69,12.0,8,350.0,160,4456,13.5,72.0,1,oldsmobile delta 88 royale

In [47]:
cars.columns

Index(['mpg', 'cylinders', 'displacement', 'horsepower', 'weight',
       'acceleration', 'model year', 'origin', 'car name'],
      dtype='object')

In [49]:
for col in cars.columns:
    print("bonjour", col.upper())

bonjour MPG
bonjour CYLINDERS
bonjour DISPLACEMENT
bonjour HORSEPOWER
bonjour WEIGHT
bonjour ACCELERATION
bonjour MODEL YEAR
bonjour ORIGIN
bonjour CAR NAME

In [51]:
cars.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model year,origin,car name
0,18.0,8,307.0,130,3504,12.0,70.0,1,chevrolet chevelle malibu
1,15.0,8,350.0,165,3693,11.5,70.0,1,buick skylark 320
2,18.0,8,NaN,150,3436,11.0,70.0,1,plymouth satellite
3,16.0,8,304.0,150,3433,12.0,70.0,1,amc rebel sst
4,17.0,8,302.0,140,3449,10.5,70.0,1,ford torino

In [50]:
cars.dtypes

mpg             float64
cylinders         int64
displacement    float64
horsepower       object
weight            int64
acceleration    float64
model year      float64
origin            int64
car name         object
dtype: object

In [55]:
cars.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 398 entries, 0 to 397
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   mpg           398 non-null    float64
 1   cylinders     398 non-null    int64
 2   displacement  393 non-null    float64
 3   horsepower    397 non-null    object
 4   weight        398 non-null    int64
 5   acceleration  396 non-null    float64
 6   model year    396 non-null    float64
 7   origin        398 non-null    int64
 8   car name      398 non-null    object
dtypes: float64(4), int64(3), object(2)
memory usage: 28.1+ KB

In [56]:
cars.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model year,origin,car name
0,18.0,8,307.0,130,3504,12.0,70.0,1,chevrolet chevelle malibu
1,15.0,8,350.0,165,3693,11.5,70.0,1,buick skylark 320
2,18.0,8,NaN,150,3436,11.0,70.0,1,plymouth satellite
3,16.0,8,304.0,150,3433,12.0,70.0,1,amc rebel sst
4,17.0,8,302.0,140,3449,10.5,70.0,1,ford torino

In [57]:
cars.describe()

,mpg,cylinders,displacement,weight,acceleration,model year,origin
count,398.000000,398.000000,393.000000,398.000000,396.000000,396.000000,398.000000
mean,23.514573,5.454774,192.609415,2970.424623,15.559596,76.035354,1.572864
std,7.815984,1.701004,103.547981,846.841774,2.752358,3.689707,0.802055
min,9.000000,3.000000,68.000000,1613.000000,8.000000,70.000000,1.000000
25%,17.500000,4.000000,104.000000,2223.750000,13.800000,73.000000,1.000000
50%,23.000000,4.000000,146.000000,2803.500000,15.500000,76.000000,1.000000
75%,29.000000,8.000000,260.000000,3608.000000,17.125000,79.000000,2.000000
max,46.600000,8.000000,455.000000,5140.000000,24.800000,82.000000,3.000000

## Navigation par colonne

In [65]:
type(cars)

pandas.core.frame.DataFrame

In [66]:
cars.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model year,origin,car name
0,18.0,8,307.0,130,3504,12.0,70.0,1,chevrolet chevelle malibu
1,15.0,8,350.0,165,3693,11.5,70.0,1,buick skylark 320
2,18.0,8,NaN,150,3436,11.0,70.0,1,plymouth satellite
3,16.0,8,304.0,150,3433,12.0,70.0,1,amc rebel sst
4,17.0,8,302.0,140,3449,10.5,70.0,1,ford torino

In [69]:
cars.mpg

0      18.0
1      15.0
2      18.0
3      16.0
4      17.0
       ...
393    27.0
394    44.0
395    32.0
396    28.0
397    31.0
Name: mpg, Length: 398, dtype: float64

In [73]:
cars.mpg.max()

46.6

In [74]:
cars.mpg.min()

9.0

In [75]:
cars.mpg.mean()

23.514572864321607

In [77]:
cars.mpg.quantile(0.90)

34.33

In [83]:
cars.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model year,origin,car name
0,18.0,8,307.0,130,3504,12.0,70.0,1,chevrolet chevelle malibu
1,15.0,8,350.0,165,3693,11.5,70.0,1,buick skylark 320
2,18.0,8,NaN,150,3436,11.0,70.0,1,plymouth satellite
3,16.0,8,304.0,150,3433,12.0,70.0,1,amc rebel sst
4,17.0,8,302.0,140,3449,10.5,70.0,1,ford torino

In [86]:
cars.weight.sum()

1182229

In [89]:
cars.weight.sum() // 1000

1182

In [94]:
cars["model year"].value_counts().sort_index()

70.0    29
71.0    26
72.0    28
73.0    40
74.0    27
75.0    30
76.0    34
77.0    28
78.0    36
79.0    29
80.0    29
81.0    29
82.0    31
Name: model year, dtype: int64

In [91]:
cars.cylinders.value_counts()

4    204
8    103
6     84
3      4
5      3
Name: cylinders, dtype: int64

In [95]:
cars.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model year,origin,car name
0,18.0,8,307.0,130,3504,12.0,70.0,1,chevrolet chevelle malibu
1,15.0,8,350.0,165,3693,11.5,70.0,1,buick skylark 320
2,18.0,8,NaN,150,3436,11.0,70.0,1,plymouth satellite
3,16.0,8,304.0,150,3433,12.0,70.0,1,amc rebel sst
4,17.0,8,302.0,140,3449,10.5,70.0,1,ford torino

In [98]:
cars.sort_values("mpg", ascending=False).head(10)

,mpg,cylinders,displacement,horsepower,weight,acceleration,model year,origin,car name
322,46.6,4,86.0,65,2110,17.9,80.0,3,mazda glc
329,44.6,4,91.0,67,1850,13.8,80.0,3,honda civic 1500 gl
325,44.3,4,90.0,48,2085,21.7,80.0,2,vw rabbit c (diesel)
394,44.0,4,97.0,52,2130,24.6,82.0,2,vw pickup
326,43.4,4,90.0,48,2335,23.7,80.0,2,vw dasher (diesel)
244,43.1,4,90.0,48,1985,21.5,78.0,2,volkswagen rabbit custom diesel
309,41.5,4,98.0,76,2144,14.7,80.0,2,vw rabbit
330,40.9,4,85.0,?,1835,17.3,80.0,2,renault lecar deluxe
324,40.8,4,85.0,65,2110,19.2,80.0,3,datsun 210
247,39.4,4,85.0,70,2070,18.6,78.0,3,datsun b210 gx

In [99]:
cars.cylinders.unique()

array([8, 4, 6, 3, 5], dtype=int64)

In [100]:
cars.origin.unique()

array([1, 3, 2], dtype=int64)

In [102]:
cars.origin.nunique()

3

In [103]:
cars.cylinders.nunique()

5

In [107]:
cars.shape

(398, 9)

Pour compter les paires de variables

In [108]:
cars.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model year,origin,car name
0,18.0,8,307.0,130,3504,12.0,70.0,1,chevrolet chevelle malibu
1,15.0,8,350.0,165,3693,11.5,70.0,1,buick skylark 320
2,18.0,8,NaN,150,3436,11.0,70.0,1,plymouth satellite
3,16.0,8,304.0,150,3433,12.0,70.0,1,amc rebel sst
4,17.0,8,302.0,140,3449,10.5,70.0,1,ford torino

In [110]:
pd.crosstab(cars.cylinders, cars.origin)

origin       1   2   3
cylinders
3            0   0   4
4           72  63  69
5            0   3   0
6           74   4   6
8          103   0   0

## Sélection dans le DataFrame

In [112]:
cars.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model year,origin,car name
0,18.0,8,307.0,130,3504,12.0,70.0,1,chevrolet chevelle malibu
1,15.0,8,350.0,165,3693,11.5,70.0,1,buick skylark 320
2,18.0,8,NaN,150,3436,11.0,70.0,1,plymouth satellite
3,16.0,8,304.0,150,3433,12.0,70.0,1,amc rebel sst
4,17.0,8,302.0,140,3449,10.5,70.0,1,ford torino

### par nom de colonne

In [119]:
cars_main = cars[['mpg', 'cylinders', 'displacement']].head()

### par condition

In [121]:
cars.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model year,origin,car name
0,18.0,8,307.0,130,3504,12.0,70.0,1,chevrolet chevelle malibu
1,15.0,8,350.0,165,3693,11.5,70.0,1,buick skylark 320
2,18.0,8,NaN,150,3436,11.0,70.0,1,plymouth satellite
3,16.0,8,304.0,150,3433,12.0,70.0,1,amc rebel sst
4,17.0,8,302.0,140,3449,10.5,70.0,1,ford torino

In [124]:
cars.mpg > 16

0       True
1      False
2       True
3      False
4       True
       ...
393     True
394     True
395     True
396     True
397     True
Name: mpg, Length: 398, dtype: bool

In [129]:
(cars.mpg > 16).sum()

311

In [132]:
cars[cars.mpg > 16]

,mpg,cylinders,displacement,horsepower,weight,acceleration,model year,origin,car name
0,18.0,8,307.0,130,3504,12.0,70.0,1,chevrolet chevelle malibu
2,18.0,8,NaN,150,3436,11.0,70.0,1,plymouth satellite
4,17.0,8,302.0,140,3449,10.5,70.0,1,ford torino
14,24.0,4,113.0,95,2372,15.0,70.0,3,toyota corona mark ii
15,22.0,6,198.0,95,2833,15.5,70.0,1,plymouth duster
...,...,...,...,...,...,...,...,...,...
393,27.0,4,140.0,86,2790,15.6,82.0,1,ford mustang gl
394,44.0,4,97.0,52,2130,24.6,82.0,2,vw pickup
395,32.0,4,135.0,84,2295,11.6,82.0,1,dodge rampage
396,28.0,4,120.0,79,2625,18.6,82.0,1,ford ranger
397,31.0,4,119.0,82,2720,19.4,82.0,1,chevy s-10

In [133]:
cars[cars.mpg > 16].shape

(311, 9)

In [134]:
cars[cars.mpg > 16].head(10)

,mpg,cylinders,displacement,horsepower,weight,acceleration,model year,origin,car name
0,18.0,8,307.0,130,3504,12.0,70.0,1,chevrolet chevelle malibu
2,18.0,8,NaN,150,3436,11.0,70.0,1,plymouth satellite
4,17.0,8,302.0,140,3449,10.5,70.0,1,ford torino
14,24.0,4,113.0,95,2372,15.0,70.0,3,toyota corona mark ii
15,22.0,6,198.0,95,2833,15.5,70.0,1,plymouth duster
16,18.0,6,199.0,97,2774,15.5,70.0,1,amc hornet
17,21.0,6,200.0,85,2587,16.0,70.0,1,ford maverick
18,27.0,4,97.0,88,2130,14.5,70.0,3,datsun pl510
19,26.0,4,97.0,46,1835,NaN,70.0,2,volkswagen 1131 deluxe sedan
20,25.0,4,NaN,87,2672,17.5,70.0,2,peugeot 504

In [135]:
cars.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model year,origin,car name
0,18.0,8,307.0,130,3504,12.0,70.0,1,chevrolet chevelle malibu
1,15.0,8,350.0,165,3693,11.5,70.0,1,buick skylark 320
2,18.0,8,NaN,150,3436,11.0,70.0,1,plymouth satellite
3,16.0,8,304.0,150,3433,12.0,70.0,1,amc rebel sst
4,17.0,8,302.0,140,3449,10.5,70.0,1,ford torino

In [137]:
cars[cars.cylinders == 3]

,mpg,cylinders,displacement,horsepower,weight,acceleration,model year,origin,car name
71,19.0,3,70.0,97,2330,13.5,72.0,3,mazda rx2 coupe
111,18.0,3,70.0,90,2124,13.5,73.0,3,maxda rx3
243,21.5,3,80.0,110,2720,13.5,77.0,3,mazda rx-4
334,23.7,3,70.0,100,2420,12.5,80.0,3,mazda rx-7 gs

In [141]:
cars.head(10)

,mpg,cylinders,displacement,horsepower,weight,acceleration,model year,origin,car name
0,18.0,8,307.0,130,3504,12.0,70.0,1,chevrolet chevelle malibu
1,15.0,8,350.0,165,3693,11.5,70.0,1,buick skylark 320
2,18.0,8,NaN,150,3436,11.0,70.0,1,plymouth satellite
3,16.0,8,304.0,150,3433,12.0,70.0,1,amc rebel sst
4,17.0,8,302.0,140,3449,10.5,70.0,1,ford torino
5,15.0,8,429.0,198,4341,10.0,70.0,1,ford galaxie 500
6,14.0,8,454.0,220,4354,9.0,70.0,1,chevrolet impala
7,14.0,8,440.0,215,4312,8.5,70.0,1,plymouth fury iii
8,14.0,8,NaN,225,4425,10.0,70.0,1,pontiac catalina
9,15.0,8,390.0,190,3850,8.5,70.0,1,amc ambassador dpl

In [142]:
cars["car name"].str.contains("ford").head(10)

0    False
1    False
2    False
3    False
4     True
5     True
6    False
7    False
8    False
9    False
Name: car name, dtype: bool

In [147]:
cars.mpg.mean().round(2)

23.51

In [152]:
cars[cars["car name"].str.contains("ford")].head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model year,origin,car name
4,17.0,8,302.0,140,3449,10.5,70.0,1,ford torino
5,15.0,8,429.0,198,4341,10.0,70.0,1,ford galaxie 500
17,21.0,6,200.0,85,2587,16.0,70.0,1,ford maverick
25,10.0,8,360.0,215,4615,NaN,70.0,1,ford f250
32,25.0,4,NaN,?,2046,19.0,71.0,1,ford pinto

In [153]:
cars[cars["car name"].str.contains("ford")].shape

(51, 9)

`~` est la négation logique, le contraire.

In [155]:
~cars["car name"].str.contains("ford")

0       True
1       True
2       True
3       True
4      False
       ...
393    False
394     True
395     True
396    False
397     True
Name: car name, Length: 398, dtype: bool

In [156]:
cars[~cars["car name"].str.contains("ford")].shape

(347, 9)

In [157]:
cars[~cars["car name"].str.contains("ford")].head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model year,origin,car name
0,18.0,8,307.0,130,3504,12.0,70.0,1,chevrolet chevelle malibu
1,15.0,8,350.0,165,3693,11.5,70.0,1,buick skylark 320
2,18.0,8,NaN,150,3436,11.0,70.0,1,plymouth satellite
3,16.0,8,304.0,150,3433,12.0,70.0,1,amc rebel sst
6,14.0,8,454.0,220,4354,9.0,70.0,1,chevrolet impala

`&` est le "AND"

`|` est le "OR"

In [164]:
cars[(cars.mpg > 15) & (cars.weight > 3500)].head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model year,origin,car name
0,18.0,8,307.0,130,3504,12.0,70.0,1,chevrolet chevelle malibu
66,17.0,8,304.0,150,3672,11.5,72.0,1,amc ambassador sst
116,16.0,8,400.0,230,4278,9.5,73.0,1,pontiac grand prix
133,16.0,6,250.0,100,3781,17.0,74.0,1,chevrolet chevelle malibu classic
134,16.0,6,258.0,110,3632,18.0,74.0,1,amc matador

In [166]:
cars[(cars.mpg > 18) | (cars.weight > 3500)].sample(5)

,mpg,cylinders,displacement,horsepower,weight,acceleration,model year,origin,car name
135,18.0,6,225.0,105,3613,16.5,74.0,1,plymouth satellite sebring
62,13.0,8,350.0,165,4274,12.0,72.0,1,chevrolet impala
87,13.0,8,350.0,145,3988,13.0,73.0,1,chevrolet malibu
167,29.0,4,97.0,75,2171,16.0,75.0,3,toyota corolla
241,22.0,6,146.0,97,2815,14.5,77.0,3,datsun 810

In [170]:
cars.cylinders.isin([3, 5])

0      False
1      False
2      False
3      False
4      False
       ...
393    False
394    False
395    False
396    False
397    False
Name: cylinders, Length: 398, dtype: bool

In [171]:
cars[cars.cylinders.isin([3, 5])]

,mpg,cylinders,displacement,horsepower,weight,acceleration,model year,origin,car name
71,19.0,3,70.0,97,2330,13.5,72.0,3,mazda rx2 coupe
111,18.0,3,70.0,90,2124,13.5,73.0,3,maxda rx3
243,21.5,3,80.0,110,2720,13.5,77.0,3,mazda rx-4
274,20.3,5,131.0,103,2830,15.9,78.0,2,audi 5000
297,25.4,5,183.0,77,3530,20.1,79.0,2,mercedes benz 300d
327,36.4,5,121.0,67,2950,19.9,80.0,2,audi 5000s (diesel)
334,23.7,3,70.0,100,2420,12.5,80.0,3,mazda rx-7 gs

In [173]:
cars.acceleration.mean().round(2)

15.56

In [174]:
cars[cars.acceleration > cars.acceleration.mean()][["mpg", "acceleration", "car name"]]

      mpg  acceleration          car name
17   21.0          16.0     ford maverick
20   25.0          17.5       peugeot 504
22   25.0          17.5          saab 99e
28    9.0          18.5          hi 1200d
32   25.0          19.0        ford pinto
..    ...           ...               ...
392  27.0          17.3  chevrolet camaro
393  27.0          15.6   ford mustang gl
394  44.0          24.6         vw pickup
396  28.0          18.6       ford ranger
397  31.0          19.4        chevy s-10

[183 rows x 3 columns]

### par indice numérique

In [175]:
cars.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model year,origin,car name
0,18.0,8,307.0,130,3504,12.0,70.0,1,chevrolet chevelle malibu
1,15.0,8,350.0,165,3693,11.5,70.0,1,buick skylark 320
2,18.0,8,NaN,150,3436,11.0,70.0,1,plymouth satellite
3,16.0,8,304.0,150,3433,12.0,70.0,1,amc rebel sst
4,17.0,8,302.0,140,3449,10.5,70.0,1,ford torino

In [181]:
cars.iloc[0]

mpg                                    18
cylinders                               8
displacement                          307
horsepower                            130
weight                               3504
acceleration                           12
model year                             70
origin                                  1
car name        chevrolet chevelle malibu
Name: 0, dtype: object

In [182]:
cars.iloc[:3]

,mpg,cylinders,displacement,horsepower,weight,acceleration,model year,origin,car name
0,18.0,8,307.0,130,3504,12.0,70.0,1,chevrolet chevelle malibu
1,15.0,8,350.0,165,3693,11.5,70.0,1,buick skylark 320
2,18.0,8,NaN,150,3436,11.0,70.0,1,plymouth satellite

In [183]:
cars.iloc[50:55]

,mpg,cylinders,displacement,horsepower,weight,acceleration,model year,origin,car name
50,28.0,4,116.0,90,2123,14.0,71.0,2,opel 1900
51,30.0,4,79.0,70,2074,19.5,71.0,2,peugeot 304
52,30.0,4,88.0,76,2065,14.5,71.0,2,fiat 124b
53,31.0,4,71.0,65,1773,19.0,71.0,3,toyota corolla 1200
54,35.0,4,72.0,69,1613,18.0,71.0,3,datsun 1200

In [184]:
cars.iloc[50:55, 1:3]

    cylinders  displacement
50          4         116.0
51          4          79.0
52          4          88.0
53          4          71.0
54          4          72.0

## Création de colonnes

In [185]:
cars.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model year,origin,car name
0,18.0,8,307.0,130,3504,12.0,70.0,1,chevrolet chevelle malibu
1,15.0,8,350.0,165,3693,11.5,70.0,1,buick skylark 320
2,18.0,8,NaN,150,3436,11.0,70.0,1,plymouth satellite
3,16.0,8,304.0,150,3433,12.0,70.0,1,amc rebel sst
4,17.0,8,302.0,140,3449,10.5,70.0,1,ford torino

In [189]:
cars["is_fast"] = cars.acceleration > 22

`mpg` veut dire miles per gallon

In [193]:
cars["miles_per_liter"] = (cars["mpg"] / 4.54).round(2)

In [194]:
cars.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model year,origin,car name,is_fast,miles_per_liter
0,18.0,8,307.0,130,3504,12.0,70.0,1,chevrolet chevelle malibu,False,3.96
1,15.0,8,350.0,165,3693,11.5,70.0,1,buick skylark 320,False,3.30
2,18.0,8,NaN,150,3436,11.0,70.0,1,plymouth satellite,False,3.96
3,16.0,8,304.0,150,3433,12.0,70.0,1,amc rebel sst,False,3.52
4,17.0,8,302.0,140,3449,10.5,70.0,1,ford torino,False,3.74

## Traitement des valeurs nulles

In [205]:
cars.displacement.isna()

0      False
1      False
2       True
3      False
4      False
       ...
393    False
394    False
395    False
396    False
397    False
Name: displacement, Length: 398, dtype: bool

In [206]:
cars[cars.displacement.isna()]

,mpg,cylinders,displacement,horsepower,weight,acceleration,model year,origin,car name,is_fast,miles_per_liter,acceleration per pound
2,18.0,8,NaN,150,3436,11.0,70.0,1,plymouth satellite,False,3.96,0.003201
8,14.0,8,NaN,225,4425,10.0,70.0,1,pontiac catalina,False,3.08,0.002260
20,25.0,4,NaN,87,2672,17.5,70.0,2,peugeot 504,False,5.51,0.006549
26,10.0,8,NaN,200,4376,15.0,70.0,1,chevy c20,False,2.20,0.003428
32,25.0,4,NaN,?,2046,19.0,71.0,1,ford pinto,False,5.51,0.009286

In [207]:
cars.isna()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model year,origin,car name,is_fast,miles_per_liter,acceleration per pound
0,False,False,False,False,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,True,False,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...,...,...,...,...
393,False,False,False,False,False,False,False,False,False,False,False,False
394,False,False,False,False,False,False,False,False,False,False,False,False
395,False,False,False,False,False,False,False,False,False,False,False,False
396,False,False,False,False,False,False,False,False,False,False,False,False
397,False,False,False,False,False,False,False,False,False,False,False,False

In [210]:
cars.isna().any()

mpg                       False
cylinders                 False
displacement               True
horsepower                 True
weight                    False
acceleration               True
model year                 True
origin                    False
car name                  False
is_fast                   False
miles_per_liter           False
acceleration per pound     True
dtype: bool

In [211]:
cars.isna().any(axis=1)

0      False
1      False
2       True
3      False
4      False
       ...
393    False
394    False
395    False
396    False
397    False
Length: 398, dtype: bool

In [212]:
cars[cars.isna().any(axis=1)]

,mpg,cylinders,displacement,horsepower,weight,acceleration,model year,origin,car name,is_fast,miles_per_liter,acceleration per pound
2,18.0,8,NaN,150,3436,11.0,70.0,1,plymouth satellite,False,3.96,0.003201
8,14.0,8,NaN,225,4425,10.0,70.0,1,pontiac catalina,False,3.08,0.002260
12,15.0,8,400.0,NaN,3761,9.5,70.0,1,chevrolet monte carlo,False,3.30,0.002526
19,26.0,4,97.0,46,1835,NaN,70.0,2,volkswagen 1131 deluxe sedan,False,5.73,NaN
20,25.0,4,NaN,87,2672,17.5,70.0,2,peugeot 504,False,5.51,0.006549
25,10.0,8,360.0,215,4615,NaN,70.0,1,ford f250,False,2.20,NaN
26,10.0,8,NaN,200,4376,15.0,70.0,1,chevy c20,False,2.20,0.003428
31,25.0,4,113.0,95,2228,14.0,NaN,3,toyota corona,False,5.51,0.006284
32,25.0,4,NaN,?,2046,19.0,71.0,1,ford pinto,False,5.51,0.009286
38,14.0,8,350.0,165,4209,12.0,NaN,1,chevrolet impala,False,3.08,0.002851

Que faisons-nous ? Nous pouvons remplir

### remplissage fixe

In [213]:
cars.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model year,origin,car name,is_fast,miles_per_liter,acceleration per pound
0,18.0,8,307.0,130,3504,12.0,70.0,1,chevrolet chevelle malibu,False,3.96,0.003425
1,15.0,8,350.0,165,3693,11.5,70.0,1,buick skylark 320,False,3.30,0.003114
2,18.0,8,NaN,150,3436,11.0,70.0,1,plymouth satellite,False,3.96,0.003201
3,16.0,8,304.0,150,3433,12.0,70.0,1,amc rebel sst,False,3.52,0.003495
4,17.0,8,302.0,140,3449,10.5,70.0,1,ford torino,False,3.74,0.003044

In [214]:
cars.fillna(0).head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model year,origin,car name,is_fast,miles_per_liter,acceleration per pound
0,18.0,8,307.0,130,3504,12.0,70.0,1,chevrolet chevelle malibu,False,3.96,0.003425
1,15.0,8,350.0,165,3693,11.5,70.0,1,buick skylark 320,False,3.30,0.003114
2,18.0,8,0.0,150,3436,11.0,70.0,1,plymouth satellite,False,3.96,0.003201
3,16.0,8,304.0,150,3433,12.0,70.0,1,amc rebel sst,False,3.52,0.003495
4,17.0,8,302.0,140,3449,10.5,70.0,1,ford torino,False,3.74,0.003044

### remplissage avec la moyenne

In [215]:
cars.mpg.mean()

23.514572864321607

In [221]:
cars.mean().round(3)

mpg                         23.515
cylinders                    5.455
displacement               192.609
weight                    2970.425
acceleration                15.560
model year                  76.035
origin                       1.573
is_fast                      0.018
miles_per_liter              5.179
acceleration per pound       0.006
dtype: float64

In [222]:
cars.fillna(cars.mean()).head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model year,origin,car name,is_fast,miles_per_liter,acceleration per pound
0,18.0,8,307.000000,130,3504,12.0,70.0,1,chevrolet chevelle malibu,False,3.96,0.003425
1,15.0,8,350.000000,165,3693,11.5,70.0,1,buick skylark 320,False,3.30,0.003114
2,18.0,8,192.609415,150,3436,11.0,70.0,1,plymouth satellite,False,3.96,0.003201
3,16.0,8,304.000000,150,3433,12.0,70.0,1,amc rebel sst,False,3.52,0.003495
4,17.0,8,302.000000,140,3449,10.5,70.0,1,ford torino,False,3.74,0.003044

### supprimer une colonne

C'est un peu une bête

In [223]:
cars.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model year,origin,car name,is_fast,miles_per_liter,acceleration per pound
0,18.0,8,307.0,130,3504,12.0,70.0,1,chevrolet chevelle malibu,False,3.96,0.003425
1,15.0,8,350.0,165,3693,11.5,70.0,1,buick skylark 320,False,3.30,0.003114
2,18.0,8,NaN,150,3436,11.0,70.0,1,plymouth satellite,False,3.96,0.003201
3,16.0,8,304.0,150,3433,12.0,70.0,1,amc rebel sst,False,3.52,0.003495
4,17.0,8,302.0,140,3449,10.5,70.0,1,ford torino,False,3.74,0.003044

In [224]:
cars.drop("displacement", axis=1).head()

,mpg,cylinders,horsepower,weight,acceleration,model year,origin,car name,is_fast,miles_per_liter,acceleration per pound
0,18.0,8,130,3504,12.0,70.0,1,chevrolet chevelle malibu,False,3.96,0.003425
1,15.0,8,165,3693,11.5,70.0,1,buick skylark 320,False,3.30,0.003114
2,18.0,8,150,3436,11.0,70.0,1,plymouth satellite,False,3.96,0.003201
3,16.0,8,150,3433,12.0,70.0,1,amc rebel sst,False,3.52,0.003495
4,17.0,8,140,3449,10.5,70.0,1,ford torino,False,3.74,0.003044

### supprimer des lignes

In [227]:
cars[cars.displacement.notna()].head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model year,origin,car name,is_fast,miles_per_liter,acceleration per pound
0,18.0,8,307.0,130,3504,12.0,70.0,1,chevrolet chevelle malibu,False,3.96,0.003425
1,15.0,8,350.0,165,3693,11.5,70.0,1,buick skylark 320,False,3.30,0.003114
3,16.0,8,304.0,150,3433,12.0,70.0,1,amc rebel sst,False,3.52,0.003495
4,17.0,8,302.0,140,3449,10.5,70.0,1,ford torino,False,3.74,0.003044
5,15.0,8,429.0,198,4341,10.0,70.0,1,ford galaxie 500,False,3.30,0.002304

## GroupBy

In [228]:
cars.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model year,origin,car name,is_fast,miles_per_liter,acceleration per pound
0,18.0,8,307.0,130,3504,12.0,70.0,1,chevrolet chevelle malibu,False,3.96,0.003425
1,15.0,8,350.0,165,3693,11.5,70.0,1,buick skylark 320,False,3.30,0.003114
2,18.0,8,NaN,150,3436,11.0,70.0,1,plymouth satellite,False,3.96,0.003201
3,16.0,8,304.0,150,3433,12.0,70.0,1,amc rebel sst,False,3.52,0.003495
4,17.0,8,302.0,140,3449,10.5,70.0,1,ford torino,False,3.74,0.003044

In [230]:
cars.groupby('cylinders').acceleration.mean().round(2)

cylinders
3    13.25
4    16.58
5    18.63
6    16.26
8    12.95
Name: acceleration, dtype: float64

In [232]:
cars.groupby('cylinders').agg({'acceleration': 'mean', 'weight': 'max'}).head().round(2)

           acceleration  weight
cylinders
3                 13.25    2720
4                 16.58    3270
5                 18.63    3530
6                 16.26    3907
8                 12.95    5140

## Application des fonctions

Nous utilisons la méthode `apply`.

In [ ]:
cars.head()

Imaginons que l'on veuille calculer, pour chaque voiture :

 * le premier mot du nom

 * si l'année modèle était une année bissextile.

Nous créons d'abord la fonction, puis nous l'appliquons

In [ ]:
def get_first_word(sentence):
    words = sentence.split()
    
    return words[0]

In [ ]:
get_first_word("hola me llamo manuel")

In [ ]:
def is_bisiest(year):
    if year % 4 == 0:
        return True
    else:
        return False

In [ ]:
is_bisiest(2001)

In [ ]:
cars["is_bisiest"] = cars["model year"].apply(is_bisiest)

In [ ]:
cars["name1"] = cars["car name"].apply(get_first_word)

In [ ]:
cars.head()

## Exportation des données

In [ ]:
cars.to_csv('../datasets/test/cars1.csv', index=False)

In [ ]:
cars.to_csv('../datasets/test/cars2.csv', index=True)

In [ ]:
df.to_json('../datasets/test/cars.json', orient='records')

In [ ]:
df.to_excel('../datasets/test/cars.xlsx', index=False)

## Récapitulatif : les méthodes les plus utilisées de pandas

```python
df.head()                     # printea la cabeza, por defecto 5 filas
df.tail()                     # pritea la cola, por defecto 5 filas
df.describe()                 # descripcion estadistica
df.info()                     # informacion del df
df.info(memory_usage='deep')
df.columns                    # muestra columna
df.index                      # muestra indice
df.dtypes                     # muestra tipos de datos de las columnas
df.plot()                     # hace un grafico
df.hist()                     # hace un histograma
df.col.value_counts()         # cuenta los valores unicos de una columna
df.col.unique()               # muestra valores unicos de una columna
df.copy()                     # copia el df
df.drop()                     # elimina columnas o filas (axis=0,1)
df.dropna()                   # elimina nulos
df.fillna()                   # rellena nulos
df.shape                      # dimensiones del df
df._get_numeric_data()        # selecciona columnas numericas
df.rename()                   # renombre columnas
df.str.replace()              # reemplaza columnas de strings
df.astype(dtype='float32')    # cambia el tipo de dato
df.iloc[]                     # localiza por indice
df.loc[]                      # localiza por elemento
df.transpose()                # transpone el df
df.T
df.sample(n, frac)            # muestra del df
df.col.sum()                  # suma de una columna
df.col.max()                  # maximo de una columna
df.col.min()                  # minimo de una columna
df[col]                       # selecciona columna
df.col
df.isnull()                   # valores nulos
df.isna()
df.notna()                    # valores no nulos
df.drop_duplicates()          # eliminar duplicados
df.reset_index(inplace=True)  # resetea el indice y sobreescribe
```

## Matériel supplémentaire !

* [Cheatsheet](https://pandas.pydata.org/Pandas_Cheat_Sheet.pdf)
* [Exercices pratiques](https://github.com/guipsamora/pandas_exercises)
* [merge, concat, join](https://realpython.com/pandas-merge-join-and-concat/#pandas-join-combining-data-on-a-column-or-index)